{
  "detection":
  {
    "goal": "FRom <a class='in-text-link' target='_blank' href='/HP/Gold_Integrated.html'>conversations with Photanol</a> we know that, in our quest to engineer fumarate-producing cyanobacterial factories, we need a way to quickly and easily determine if a given genetically engineered construct is actually producing fumarate. For this purpose, we constructed a biosensor, i.e. an <i>Escherichia Coli</i> strain that is able to sense and quantitatively report the presence of fumarate in the extracellular medium. ",
    "overview": "Our fumarate biosensor is based on a well-characterized chimeric two-component system. When integrated in <i>E. coli</i>, this system has been reported to make the cells fluoresce when fumarate is in the environment. We constructed and investigated the functionality of different variants of this system in <i>E. coli</i>. This way we created several variants of our necessary fumarate biosensor, while deepening our fundamental understanding of chimeric two-component systems at the same time!",
    "highlights":
    [
      "Engineered at least 3 functional biosensors with a combined signal dynamic range of 0.1-20 mM fumarate.",
      "Investigated the effect of linker length and kinase orientation on biosensor functionality.",
      "Demonstrated real world applicability."
    ],
    "references":
    [
      "Hazelbauer, G. L., & Lai, W. C. (2010). Bacterial chemoreceptors: providing enhanced features to two-component signaling. <i>Current opinion in microbiology</i>, 13(2), 124-132.",
      "Stock, A. M., Robinson, V. L., & Goudreau, P. N. (2000). Two-component signal transduction. <i>Annual review of biochemistry</i>, 69(1), 183-215.",
      "Ganesh, I., Ravikumar, S., Lee, S. H., Park, S. J., & Hong, S. H. (2013). Engineered fumarate sensing Escherichia coli based on novel chimeric two-component system. <i>Journal of biotechnology</i>, 168(4), 560-566.",
      "G&#246rke, B., & St&#252lke, J. (2008). Carbon catabolite repression in bacteria: many ways to make the most out of nutrients. <i>Nature Reviews Microbiology</i>, 6(8), 613-624.",
      "Bi, S., Pollard, A. M., Yang, Y., Jin, F., & Sourjik, V. (2016). Engineering hybrid chemotaxis receptors in bacteria. <i>ACS synthetic biology</i>, 5(9), 989-1001.",
      "Immethun, C. M., DeLorenzo, D. M., Focht, C. M., Gupta, D., Johnson, C. B., & Moon, T. S. (2017). Physical, chemical, and metabolic state sensors expand the synthetic biology toolbox for Synechocystis sp. PCC 6803. <i>Biotechnology and Bioengineering</i>.",
      "Batchelor, E., Silhavy, T. J., & Goulian, M. (2004). Continuous control in bacterial regulatory circuits. <i>Journal of bacteriology</i>, 186(22), 7618-7625.",
      "Bachmann, H., Fischlechner, M., Rabbers, I., Barfa, N., dos Santos, F. B., Molenaar, D., & Teusink, B. (2013). Availability of public goods shapes the evolution of competing metabolic strategies.<i>Proceedings of the National Academy of Sciences</i>, 110(35), 14302-14307."
    ],
    "collapsibles":
    [
      {
        "id": "first",
        "title": "Constructing a family of biosensors",
        "sections":
        [
          {
            "id": "intro1",
            "title": "Introduction",
            "contents":
            [
              "<p>Currently fumarate concentrations in liquid samples can be quantified through two well-developed methods, high-performance liquid chromatography (HPLC) and enzymatic assays. Both methods are costly and labor intensive. In our search for cyanobacterial cell-factories we need to measure fumarate concentrations very often. Measurements need to be accurate and specific to fumarate, and on top of that measuring should be quick and easy. Fortunately, synthetic biology may be used to derive a solution to this inspired in nature.</p>",
              "<p>Bacteria have evolved to use two-component systems (TCS) to sense and adapt to changes in the extracellular environment. These systems are often highly specific to particular compounds and accurate in their measurement [1]. A TCS typically consists of a sensor histidine kinase (SHK) and a response regulator. The first sits in the membrane and gets activated upon sensing particular signals such as a specific compound The second gets activated by an active SHK and can then bind to DNA at specific loci to initiate a biological response [2]. We construct a fumarate biosensor based on the DcuSZ/OmpR chimeric TCS developed in <i>E. coli</i> by Ganesh et al. (2013) [3]. The SHK in this system, DcuSZ, is a fusion of two native <i>E. coli</i> SHKs, fumarate sensor DcuS and osmolarity sensor EnvZ. The protein domains in DcuSZ are the extracellular sensing domain and transmembrane domains of DcuS and the intracellular HAMP and histidine kinase domains of EnvZ. Coupling the emerging TCS to the expression of a fluorescent reporter protein leads to cells that fluoresce in response to extracellular fumarate (fig. 4.1).</p>",
              "<figure id='fig41'><img src='images/figures/Biosensor1_4.1.png' class='module-figure-image'><figcaption class='module-figure-text'><b>Figure 4.1</b> <i>The DcuS fumarate sensing, transmembrane and HAMP domains were fused to the EnvZ kinase leading to the chimeric DcuSZ/OmpR two-component system. Coupling this to fluorescent protein (EYFP) expression by using the ompC promoter leads to sensing and reporting of fumarate.</i></figcaption></figure>",
              "<p>We have created several differently fused DcuSZ genes to compare their functionality. The difference is in the length of the linker region between the DcuS and EnvZ functional domains. The linker region originates from the DcuS gene and forms an &#945;-helix. A complete turn in an &#945;-helix consists of approximately 3.6 amino acids, so by differing the linker length in steps of 5 amino acids we extend or shorten the &#945;-helix by &#126;1.4 turns per step taken. This results in a titration of the different orientations of the EnvZ kinase relative to the membrane bound DcuS domains, and thus relative to the membrane. We expect the linker length and kinase orientation play a central role in the functionality of the system. By creating 9 DcuSZ genes with different lengths (fig. 4.2), at least one of them, and at best two, are predicted to be close to the optimal orientation. By taking more than one turn per step we also scan a relatively large range of distance between the DcuS and EnvZ functional domains. This may influence the kinetics of binding and activation of the engineered TCS, possibly leading to variants with different detection limits and signal dynamic ranges for fumarate. For detailed descriptions on strain cultivation, plasmid construction, testing conditions and data analysis see the <a class=in-text-link target='_blank' href='/Detect.html#method1'>methods section.</a></p>",
              "<figure id='fig42'><img src='images/figures/Biosensor2_4.2.png' class='module-figure-image'><figcaption class='module-figure-text'><b>Figure 4.2</b> <i>The 9 DcuSZ variants, the first 1020 basepairs of DcuS remain the same and so do the 690 EnvZ basepairs. Linkers are extended or shortened at the merge between DcuS and EnvZ. Orientations of the EnvZ kinase domains are shown relative to the orientation in DcuSZ 1, which is the gene as it was constructed by Ganesh et al. (2013) [3].</i></figcaption></figure>"
            ]
          },
          {
            "id": "results1",
            "title": "Results & Disscusion",
            "contents":
            [
              "<p>Strains 1-9, containing corresponding DcuSZ 19 signaling systems, were screened for their functionality within a range of 0-10 mM of fumarate (supplementary fig. S4.1). This screening suggested that strains 1, 6 and to some extent 9 are functioning as biosensors. The screening also showed that the response in fluorescence/OD<sub>600</sub> is robust over time. Times of measurement were quite high, namely 16 and 22 hours, because the signalling system was only induced by adding anhydrotetracycline (aTc) upon addition of fumarate. Ideally the system would be induced before adding fumarate, as in our case there is more time in which the strains can take up the fumarate. However, fumarate uptake is repressed by the presence of glucose in the medium [4].</p>",
              "<p>A more thorough characterization of strains 1, 6 and 9 was performed, with a range of 0-20 mM of fumarate. By fitting a logistic curve to the data the detection limits and saturation levels of each sensing strain can be determined. Several nice examples of the logistic nature of similar sensing systems are shown by Pollard et al. (2016) [5]. By varying the linker length, and with that the kinase orientation, we expect to have changed the effectiveness of signal transduction in the chimeric DcuSZ protein. While intuitively one might expect only the range of signal detection to differ as a consequence, in reality the dynamics of the fluorescence output vary widely (fig. 4.3).</p>",
              "<figure id='fig43'><img src='images/figures/Biosensor3_4.3.png' class='module-figure-image'><figcaption class='module-figure-text'><b>Figure 4.3</b> <i>Fluorescence/OD<sub>600</sub> in strains 1, 6 and 9 for a titration of 0-20 mM fumarate. Wild type and strain specific background fluorescence were subtracted from the data as described in the <a class='in-text-link' target='_blank' href='/Detect.html#method1'>methods section</a>. The fitted curve is a Gompertz function (\\(y = a e ^{-b e^{-c x}}\\)).</i></figcaption></figure>",
              "<p>Strains 1, 6 and 9 are all functional (fig. 4.3), with relative kinase orientations of 0<sup>o</sup>, 140<sup>o</sup> and 200<sup>o</sup> respectively. DcuSZ 1 and 6 do have similar lengths, but DcuSZ 9 is 15-20 amino acids longer than DcuSZ 1 and 6, and yet strain 9 is also functional. The characterization suggests that strain 1 can be used to quantify fumarate concentrations up to 3 mM, strain 6 up to 6 mM and strain 9 even up to 20 mM (fig. 4.3). To quantify fumarate concentrations below 1 mM, calibration in the 0-1 mM range should be performed. While strain 9 can measure up to the highest fumarate concentration, it is less sensitive than strains 1 and 6. The logistic fit is the best for strain 6 and therefore its curve is the most trustworthy. The spread in the fluorescence/OD<sub>600</sub> of strain 1 is high, which leads to more uncertainty as to the level of saturation of this biosensor. The specificity to fumarate of these systems should be tested by comparing the response found here to the response to other C4-dicarboxylates (succinate, malate and aspartate). Previous work shows that the DcuSZ/OmpR system with the kinase orientation and linker length as they are in strain 1 is highly specific to fumarate [3].</p>"
            ]
          },
          {
            "id": "conc1",
            "title": "Conclusion",
            "contents":
            [
              "<p>Based on our results, we are unable to identify a general trend in functionality caused by the linker length and kinase orientation. However, the results do show a large difference in fluorescence response as a consequence of DcuSZ linker length and kinase orientation. In general we can conclude that varying the linker length and kinase orientation in the chimeric DcuSZ/OmpR TCS has a complex and often detrimental effect on its functionality. In light of our project specifically, we can conclude that we have successfully created a family of biosensors capable of quantifying its concentration from (at least) 1 up to 20 mM with different dynamic ranges.</p>"
            ]
          }
        ]
      },
      {
        "id": "second",
        "title": "Everything you need to know to make your own fumarate biosensor",
        "sections":
        [
          {
            "id": "method1",
            "title": "Materials & Methods",
            "contents":
            [
              "<p class='project-header'><u>Strains and cultivation</u></p>",
              "<p>Molecular cloning was performed in <i>E. coli</i> DH5&#945; and <i>E. coli</i> XL1-Blue growing either in liquid Luria-Bertani (LB) broth at 37&#8451; in an incubator with a shaking speed of 200 rpm, or on solidified LB plates containing 1.5% (w/v) agar. Antibiotics were added, when appropriate, in the medium for propagation of a specific plasmid. Concentrations of antibiotics used, alone or in combination, were 100 &#956;g ml<sup>-1</sup> for ampicillin, 50 &#956;g ml<sup>-1</sup> for kanamycin and 35 &#956;g ml<sup>-1</sup> for chloramphenicol.</p>",
              "<p class='project-header'><u>Plasmid construction</u></p>",
              "<p>Plasmids pCI148 and pCI146 used by Immethun et al., (2017) [6] were obtained and used as a starting point for the biosensor construction. A visual approach to plasmid construction can be seen in supplementary figure S4.2. The complete DcuS gene was amplified from the <i>E. coli</i> genome using primers 1-4, all primers can be seen in supplementary table S4.11. Amplification with these primers gave a point mutation at position 858 (T &#8594; C) to remove an Acc65I restriction site, the amino acid remains glycine (a.a. position 286). Next, the first part of DcuS was amplified with primers 5-14, adding an Acc65I restriction site to the start of the gene and resulting in DcuS fragments with 9 different lengths. The shortest fragment consists of 1020 base pairs (bp) and the longest of 1140 bp, with steps of 15 bp in between. The <i>E. coli</i> EnvZ gene was amplified from pCI148, this plasmid contains the last 690 bp of the original EnvZ gene. From pCI148 the first 570 bp of the partial EnvZ gene were amplified, up to and including the MunI restriction site, using primers 15-24. Fusion PCR resulted in 9 different DcuSZ genes, which were sequence confirmed by Macrogen Europe (supplementary table S4.2). Using Acc65I and MunI restriction enzymes the DcuSZ genes were placed in the pCI148 plasmid (replicative with an RSF1010 replicon), replacing the Cph8 gene. The DcuSZ containing plasmids were transformed into <i>E. coli</i> together with the unedited pCI146 plasmid, leading to the fumarate sensing strains.</p>",
              "<p class='project-header'><u>Testing conditions</u></p>",
              "<p>First a screening experiment was performed on all 9 strains containing the varying DcuSZ genes and the wild type. Subsequently a characterization experiment was performed for strains 1, 6 and 9. Both experiments were performed in <i>E. coli</i> DH5&#945; growing in shake flasks (screening) or glass tubes (characterization) in liquid mineral medium M9 + arginine (DSMZ 450) at 37&#8451; in an incubator with a shaking speed of 200 rpm. Antibiotics that were added to the experimental strains were kanamycin in a concentration of 25 &#956;g ml<sup>-1</sup> and chloramphenicol in a concentration of 17.5 &#956;g ml<sup>-1</sup>. Ampicillin was not used since it influences OmpC transcription [7], and our system is placed behind the OmpC promoter. Pre-cultures were grown for ~24 hours in M9 before starting the experiment. At the start of the experiment cultures were diluted to an OD<sub>600</sub> of 0.5 and aTc and fumarate were added. The final aTc concentration was 100 ng ml<sup>-1</sup> and fumarate concentrations ranged from 0 to 10 mM for the screening experiment and from 0 to 20 mM for the characterization experiment. The osmolarity of the fumarate solutions was kept equal by adding the appropriate concentration of NaCl. EYFP fluorescence was measured in a  96-well plate with a BMG FluoStar Optima plate reader, using excitation at 470 nm and emission at 510 nm, gain was set to 1000. OD<sub>600</sub> was measured using an ISOGEN Lightwave II spectrophotometer. Measurements were made after 0, 16, and 22 hours of cultivation with fumarate and aTc for the screening experiment and after 0 and 22 hours for the characterization experiment.</p>",
              "<p class='project-header'><u>Data analysis</u></p>",
              "<p>For both experiments the raw fluorescence data was corrected for position bias of the wells by subtracting the 0 hour measurement of each well from all following measurements in that well. Next, the fluorescence was normalized by dividing it by the corresponding untransformed OD<sub>600</sub> measurement. For the characterization experiment the wild type fluorescence/OD<sub>600</sub> was subtracted from fluorescence/OD<sub>600</sub> of all strains. To better compare the dynamics of each strain's response we removed the background fluorescence/OD<sub>600</sub> by subtracting the 0mM fluorescence/OD<sub>600</sub> of each strain at each time point from the fluorescence/OD<sub>600</sub> of all concentrations of that strain at that time point. This was done for both experiments. For the characterization experiment a Gompertz function was fitted to the data. The Gompertz function is a Hill equation-like logistic equation with this structure: \\(y = a e ^{-b e^{-c x}}\\) where a is the asymptote and b and c are positive numbers.</p>"
            ]
          }
        ]
      },
      {
        "id": "third",
        "title": "Real world use of our biosensors",
        "sections":
        [
          {
            "id": "intro2",
            "title": "Introduction",
            "contents":
            [
              "<p>We have developed a family of biosensors to screen for fumarate production in our different <a class='in-text-link' target='_blank' href='/Produce.html'><i>Synechocystis</i> cell factories</a>. In their current form, this can be done in several ways. To screen a large amount of producing cells, as would be the case when screening a <a class='in-text-link' target='_blank' href='/Produce.html#intro3'>library</a>, you can mix the <i>E. coli</i> biosensor with <i>Synechocystis</i> cell factories in an emulsion. The emulsion can be created as shown by Bachmann et al. (2013) [8]. In this emulsion <i>E. coli</i> does not need to be able to grow, it only needs to be able to make fluorescent protein de novo. Furthermore, as long as a preferred carbon-compound is available, such as glucose, uptake of fumarate will be repressed [4].</p>",
              "<p>For a smaller range of cell factories fumarate detection can be performed in a standard 96-well plate. For the most accurate result you can pellet a culture with a producing strain and use the supernatant to resuspend the same amount of biosensor for each culture. A wild type culture should be used to subtract background fluorescence. We demonstrate this way of using the biosensor, specifically <a class='in-text-link' target='_blank' href='/Detect.html#fig43'>strain 6</a>, using a <a class='in-text-link' target='_blank' href='/Produce.html#results1'><i>&#916;fumc</i></a> culture of which we do not initially know the fumarate concentration (blind trial). Afterwards, we will validate its measurement using HPLC and compare the two.</p>"
            ]
          },
          {
            "id": "results2",
            "title": "Results & discussion",
            "contents":
            [
              "<p>The biosensor produced a significant signal for 22-60 hours after resuspension in <a class='in-text-link' target='_blank' href='/Produce.html#results1'><i>&#916;fumc</i></a> supernatant (fig. 4.4). The mean fluorescence/OD<sub>600</sub> measured over this time period in arbitrary units is approximately 3. This signal is too low to determine a fumarate concentration with strain 6, as our lowest <a class='in-text-link' target='_blank' href='/Detect.html#fig43'>calibration measurement</a> was made at 1 mM fumarate and this led to a fluorescence/OD<sub>600</sub> of about 5 AU.</p>",
              "<figure id='fig44'><img src='images/figures/Biosensor4_S4.4.png' class='module-figure-image'><figcaption class='module-figure-text'><b>Figure 4.4</b> <i>Mean fluorescence/OD<sub>600</sub> signal of 22-60 hour measurements. The error bars depict a 95% confidence interval. Wild type data was used to subtract background fluorescence/OD<sub>600</sub> as described in the <a class='in-text-link' target='_blank' href='/Detect.html#method2'>materials and methods</a>.</i></figcaption></figure>",
              "<p>HPLC measurement of the <a class='in-text-link' target='_blank' href='/Produce.html#results1'><i>&#916;fumc</i></a> supernatant gave a fumarate concentration of 0.0870 mM which confirms our conclusion that the fumarate concentration was too low to be measured by strain 6, using the current calibration. Our result does indicate that with more thorough calibration such low concentrations can also be quantified, as the sensor still produces a stable and significant signal.</p>"
            ]
          },
          {
            "id": "conc2",
            "title": "Conclusion",
            "contents":
            [
              "<p>We were able to qualitatively detect fumarate in the extracellular medium of one of our <a class='in-text-link' target='_blank' href='/Produce.html'>producing strains</a>. The results further suggest that after more thorough calibration our biosensors can be used to quantify fumarate concentrations lower than 0.1 mM.</p>"
            ]
          },
          {
            "id": "future",
            "title": "Future application",
            "contents":
            [
              "<p>Apart from its usage in <i>E. coli</i> the engineered system is also suitable to be integrated in <i>Synechocystis</i>, which could be useful for several reasons: (i) prevent the need to cultivate <i>E. coli</i> and <i>Synechocystis</i> together, which <a class='in-text-link' target='_blank' href='http://2015.igem.org/Team:Amsterdam/Project/Overview'>can be challenging</a>; (ii) under aerobic conditions <i>E. coli</i> may consume fumarate while <i>Synechocystis</i> <a class='in-text-link' target='_blank' href='/Export.html#results2'>will not</a>; and (iii) this would grant us the opportunity to engineer cell factories that detect their own production, which could be used to design more complex regulatory circuits in which cells regulate their own fumarate production. Although this was not implemented within this iGEM project, we did devise a detailed approach on how to integrate the created system in <i>Synechocystis</i> (supplementary fig. S4.3).</p>"
            ]
          },
          {
            "id": "method2",
            "title": "Materials & Methods",
            "contents":
            [
              "<p class='project-header'><u>Testing conditions</u></p>",
              "<p>Biosensor strain 6 was inoculated and cultured overnight in liquid mineral medium M9 + arginine (DSMZ 450) + 17.5 &#956;g ml<sup>-1</sup> chloramphenicol + 25 &#956;g ml<sup>-1</sup> kanamycin + 100 ng ml<sup>-1</sup> aTc, at 37&#8451; in an incubator with a shaking speed of 200 rpm. After 20 hours two aliquots of 2 ml of this culture were pelleted by centrifuging at 5000 rpm for 10 minutes, the supernatant was discarded. Next, 2 ml of both a wild type and a <a class='in-text-link' target='_blank' href='/Produce.html#results1'><i>&#916;fumc</i></a> <i>Synechocystis</i> culture were pelleted by centrifuging at 14500 rpm for 5 minutes, 1 ml of each culture's supernatant was used to resuspend one of the biosensor cell pellets in. Each resuspension was divided over 6 wells, leading to 6 replicates, in a 96-well plate which was placed in a FluoStar Optima plate reader at 37&#8451; for 60 hours. Fluorescence was measured using excitation at 470 nm and emission at 510 nm, gain was set to 1000. OD<sub>600</sub>  was also measured using the FluoStar Optima plate reader. Measurements were made every 15 minutes for 60 hours.</p>",
              "<p class='project-header'><u>Measuring using HPLC</u></p>",
              "<p>Of both cultures 1 ml was centrifuged at 15.000 rpm  for 10 min. Then 500 &#956;l supernatant was taken and filtered (Sartorius Stedin Biotech, minisart SRP 4, 0.22 &#956;m) for sample preparation. Fumarate concentration was measured by HPLC-UV/VIS (LC-20AT, Prominence, Shimadzu), with ion exclusion Rezex ROA-Organic Acid column (250x4.6 mm; Phenomenex) and UV detector (SPD-20A, Prominence, Shimadzu) at 210 nm wavelength. 50 &#956;L of the HPLC samples were injected through an autosampler (SIL-20AC, Prominence, Shimadzu), with 5 mM H2SO4 as eluent at a flow rate of 0.15 ml min<sup>-1</sup> and column temperature of 45&#8451;. Fumarate retention time was determined as 18.16 and 18.36 min and fumarate samples were normalized by a correction factor composed of 10 mM divided by the measured TES concentration.</p>",
              "<p class='project-header'><u>Data analysis</u></p>",
              "<p>Position bias was corrected for by subtracting the mean of the first three measurements in each well of all measurements in that well for both fluorescence and OD<sub>600</sub>. For the OD<sub>600</sub> the mean  OD<sub>600</sub> of the first measurement in 6 replicates was subsequently added. The OD<sub>600</sub> was inspected and found to constantly be in the range of 0.8. We know from earlier experiments that in this range the spectrophotometer that was used for the calibration gives an approximately 2.5x higher value. To be able to use this measurement with the calibration curve the OD<sub>600</sub> was multiplied by 2.5. Fluorescence was normalized by dividing it by the OD<sub>600</sub>. Background fluorescence/OD<sub>600</sub> was corrected for by subtracting the mean wild type fluorescence/OD<sub>600</sub> over 6 replicates per time point of all separate fluorescence/OD<sub>600</sub> values at that time point. The data was plotted by taking the average over 22-60 hours for every replicate and plotting the mean of these replicates with an error bar showing the 95% confidence interval.</p>"
            ]
          }
        ]
      }
    ],
    "supplementary":
    [
      "<figure id='figS41'><img src='images/figures/Biosensor5_Sfig4.1.png' class='module-figure-image'><figcaption class='module-figure-text'><b>Figure S4.1</b> <i>Screening of constructed strains, the y-axis shows Fluorescence/OD<sub>600</sub>, the background Fluorescence/OD<sub>600</sub> has been subtracted as described in the <a class='in-text-link' target='_blank' href='/Detect.html#method1'>methods section</a>. The x-axis shows fumarate concentration with a range of 0mM to 10mM. Each strain is depicted in a separate plot and two measured time points are shown, 16h (o) and 22h (&#916;).</i></figcaption></figure>",
      "<figure id='figS42'><img src='images/figures/Biosensor6_Sfig4.2.png' class='module-figure-image'><figcaption class='module-figure-text'><b>Figure S4.2</b> <i>pCI-dcuSZ plasmid construction</i></figcaption></figure>",
      "<figure id='tabS41'><img src='images/figures/Biosensor7_Stab4.1.png' class='module-figure-image'><figcaption class='module-figure-text'><b>Table S4.1</b> <i>Primers, Nucleotides in red are not on the template.</i><br>* Tm for the first pcr reaction (first part is not annealed), Tm for second reaction is 60,0 &#186C <br>** Hetero-dimer of For_dcuS with Rev_envZ</figcaption></figure>",
      "<figure id='tabS42'><img src='images/figures/Biosensor8_Stab4.2.png' class='module-figure-image'><figcaption class='module-figure-text'><b>Table S4.2</b> <i>DcuSZ 1-9 sequences of linker region, sequence confirmed by Macrogen Europe (the Netherlands)</i></figcaption></figure>",
      "<figure id='figS43'><img src='images/figures/Biosensor9_Sfig4.3.png' class='module-figure-image'><figcaption class='module-figure-text'><b>Figure S4.3</b> <i>Approach for DcuSZ/OmpR integration in the Synechocystis genome</i></figcaption></figure>"
    ]
  },
  "production":
  {
    "goal": "",
    "overview": "",
    "highlights":
    [
      "",
      "",
      ""
    ],
    "references":
    [
      "",
      "",
      ""
    ],
    "collapsibles":
    [
      {
        "id": "",
        "title": "",
        "sections":
        [
          {
            "id": "",
            "title": "",
            "contents":
            [
              "",
              "",
              ""
            ]
          }
        ]
      }
    ],
    "supplementary":
    [
      ""
    ]
  },
  "exportation":
  {
    "goal": "<p>Our newly engineered cyanobacterial factories are capable of producing fumarate directly from CO<sub>2</sub> using the energy of (sun)light. However, <a href='/HP/Gold_Integrated.html#industrial' class='in-text-link' target='_blank'>experts in the fields</a> pointed out to us that it is only the fumarate that is excreted from the cells that is readily available in a downstream process of a &#8220;real-world&#8221; scenario. Furthermore, if fumarate is accumulated intracellularly, it may prove to inhibit its own production, and potentially even growth. We therefore anticipate that ensuring an effective fumarate transport system is an important engineering target for our cell factories. In this module of the project the goal is to: (i) study the native fumarate transport system of <I>Synechocystis</i>; and (ii) overexpress heterologous transport systems that have been shown to improve fumarate extracellular production in chemoheterotrophic organisms.</p>",
    "overview": "<p>A native fumarate transport system in <I>Synechocystis</i> is yet to be identified. However, we have successfully measured extracellular fumarate production in our engineered strains, suggesting a transport mechanism of some kind must to be present. But which?</p><p>We have carried a thorough bioinformatics homology search using sequences from known fumarate transporters from other organisms. Amongst the roughly 900 candidate genes of <I>Synechocystis</i> predicted to encode putative membrane proteins, we found two suitable targets that may encode components of a dicarboxylic acid transporter (such as fumarate). To test this in silico prediction we constructed single knock-out mutants of these putative genes of unknown function. Furthermore, we have also exploited the possibility of increasing fumarate production in our engineered strains through the expression of known heterologous fumarate transporters. This strategy has led to an increase in fumarate yields in <I>E. Coli</i> of 53%1 [1]. Two versatile <a href=/Parts.html class=in-text-link target=_blank>BioBricks</a> (<a href=http://parts.igem.org/Part:BBa_K2385001 class=in-text-link target=_blank>Bba_K2385001</a> and <a href=http://parts.igem.org/Part:BBa_K2385000 class=in-text-link target=_blank>Bba_K2385000</a>) have been constructed that encode fumarate transporters from <I>Escherichia coli</i> and <I>Nodularia Spumigena</i>. Finally, we performed extensive phenotyping of all the strains constructed, with particular emphasis on the impact of the genetic interventions on fumarate import and export.</p>",
    "highlights":
    [
      "Identification of two genes in <I>Synechocystis</i>, <I>sll1103</i> and <I>sll1314</i>, encoding putative dicarboxylate transporters",
      "Experimental validation that <I>sll1314</i> encodes (part of) a transporter system involved in fumarate export",
      "Experimental validation that <I>Synechocystis</i> does not uptake fumarate from the environment",
      "Expression of neither a known fumarate transporter from <I>E. Coli</i>, nor one from <I>N. Spumigena</i>, leads to fumarate excretion in wild type <I>Synechocystis</i>"
    ],
    "references":
    [
      "IG Janausch, E Zientz, QH Tran, A Kr&ouml;ger, and G Unden. C 4-dicarboxylate carriers and sensors in bacteria. Biochimica et Biophysica Acta (BBA)-Bioenergetics, 1553(1):39-56, 2002.",
      "Paulsen, I. T., Nguyen, L., Sliwinski, M. K., Rabus, R., & Saier, M. H. (2000). Microbial genome analyses: comparative transport capabilities in eighteen prokaryotes. Journal of molecular biology, 301(1), 75-100.",
      "Rost, B. (1999). Twilight zone of protein sequence alignments. Protein engineering, 12(2), 85-94.",
      "Pirovano, W., Feenstra, K. A., & Heringa, J. (2008). PRALINE&#8482;: a strategy for improved multiple alignment of transmembrane proteins. Bioinformatics, 24(4), 492-497.",
      "S&ouml;ding, J. (2004). Protein homology detection by HMM-HMM comparison. Bioinformatics, 21(7), 951-960.",
      "Altschul, S. F., Madden, T. L., Sch&auml;ffer, A. A., Zhang, J., Zhang, Z., Miller, W., & Lipman, D. J. (1997). Gapped BLAST and PSI-BLAST: a new generation of protein database search programs. Nucleic acids research, 25(17), 3389-3402.",
      "Thompson, J. D., Gibson, T., & Higgins, D. G. (2002). Multiple sequence alignment using ClustalW and ClustalX. Current protocols in bioinformatics, 2-3.",
      "Marchler-Bauer, A., Derbyshire, M. K., Gonzales, N. R., Lu, S., Chitsaz, F., Geer, L. Y., ... & Lanczycki, C. J. (2014). CDD: NCBI's conserved domain database. Nucleic acids research, 43(D1), D222-D226.",
      "Bairoch, A., Bucher, P., & Hofmann, K. (1997). The PROSITE database, its status in 1997. Nucleic Acids Research, 25(1), 217-221.",
      "Forward, J. A., Behrendt, M. C., Wyborn, N. R., Cross, R., & Kelly, D. J. (1997). TRAP transporters: a new family of periplasmic solute transport systems encoded by the dctPQM genes of Rhodobacter capsulatus and by homologs in diverse gram-negative bacteria. Journal of bacteriology, 179(17), 5482-5493.",
      "Kaneko, T., Sato, S., Kotani, H., Tanaka, A., Asamizu, E., Nakamura, Y., ... & Kimura, T. (1996). Sequence analysis of the genome of the unicellular cyanobacterium <I>Synechocystis</i> sp. strain PCC6803. II. Sequence determination of the entire genome and assignment of potential protein-coding regions. DNA research, 3(3), 109-136.",
      "Quintero, M. J., Montesinos, M. L., Herrero, A., & Flores, E. (2001). Identification of genes encoding amino acid permeases by inactivation of selected ORFs from the <I>Synechocystis</i> genomic sequence. Genome Research, 11(12), 2034-2040.",
      "Du., W. unpublished.",
      "Savakis, P. E., Angermayr, S. A., & Hellingwerf, K. J. (2013). Synthesis of 2, 3-butanediol by <I>Synechocystis</i> sp. PCC6803 via heterologous expression of a catabolic pathway from lactic acid-and enterobacteria. Metabolic engineering, 20, 121-130.",
      "Choi, K. H., & Dobbs, F. C. (1999). Comparison of two kinds of Biolog microplates (GN and ECO) in their ability to distinguish among aquatic microbial communities. Journal of Microbiological Methods, 36(3), 203-213."
    ],
    "collapsibles":
    [
      {
        "id": "first",
        "title": "Our quest to identify the elusive, native fumarate transport system in <I>Synechocystis</i>",
        "sections":
        [
          {
            "id": "intro1",
            "title": "Introduction",
            "contents":
            [
              "<p>Our cyanobacterial cell factories produce fumarate intracellularly, but the fumarate that we measure (and could easily harvest in a <a href='/HP/Gold_Integrated.html#industrial' class='in-text-link' target='_blank'>future downstream process</a> is extracellular. The efflux of fumarate that is taking place can be either the result of passive diffusion, or facilitated by a transport system. Fumarate is a dicarboxylic acid and has dissociation constants far below the intracellular pH of <I>Synechocystis</i>. This causes fumarate to be almost completely in its ionized form, which makes it much harder to diffuse across a hydrophobic membrane. A native fumarate transport system in <I>Synechocystis</i> is yet to be identified, but this strongly suggests a transport mechanism of some kind must to be present.</p>",
              "<p>A transport mechanism in the form of a protein can be studied by knocking out the encoding gene and study the resulting phenotype. To this end, we are forced to first identify candidate genes that may putatively encode fumarate transport proteins within the genome of <I>Synechocystis</i>. Membrane transporters are notorious for being promiscuous, often displaying affinity for multiple substrates [1]. However, their specificity for certain chemical properties (e.g. presence of two carboxylic acid groups) is often sufficiently conserved across phylogenetic clades [2], making it possible to attempt the identification of genes by sequence comparisons (i.e. by homology searching). Sequence alignments unambiguously distinguish between protein pairs of similar and non-similar structure when the pairwise sequence identity is high (>40% for long alignments) [3]. Below 35%, the number of false positives increases tremendously and one can no longer infer a homologous relationship. Up to now, no C<sub>4</sub>-dicarboxylate transporter has been identified in <I>Synechocystis</i>, which already indicates that the search will not yield an unambiguous result. We went to see an expert in the field: <a href='/Attributions.html' class='in-text-link' target='_blank'>Anton Feenstra</a>, an Assistant Professor Bioinformatics at Vrije Universiteit Amsterdam.</p>",
              "<p>Together we designed a pipeline to tackle the problem from every possible angle, aiming to provide the support required for an educated selection. We made use of targeted searches, where we used sequence information from known, phylogenetically closely related transporters, but also protein motifs and conserved domains as a template for sequence alignment. Complementary, untargeted searches were used to profile large groups of sequences (including putative identifications) and find distant homologous relationships between proteins.</p>",
              "<figure id='fig31'><img src='images/figures/Figure3.1_Pipeline.png' class='module-figure-image'><figcaption class='module-figure-text'><b>Figure 3.1</b> <i>Sequence homology Pipeline using untargeted and targeted searches. Four complementary tracks to identify putative genes encoding a dicarboxylate transporter in Synechocystis. </i></figcaption></figure>",
              "<p>The pipeline entails four complementary tracks (fig 3.1.). All sequence alignment tools are used in default settings unless stated otherwise. The e-value cut-off was set to 1.0 (as to include remote homologs and manually curate the results). To prevent profile wandering with iterative tools, the inclusion threshold (e-value) for PSI-BLAST was set to 0.05.</p>",
              "<p>(1) Several proteins(families) are involved in C<sub>4</sub>-dicarboxylate transport (e.g. Dcu-, Dct- and TRAP-transporters). For each of these target groups, sets of 200 transporter(domain) sequences were profiled using PRALINE<sup>&#8482;</sup>, an alignment method that integrates membrane-specific scoring matrices to improve alignment of the transmembrane regions [4]. It creates a Multiple Sequence Alignment file (MSA), that is taken as a template for HHSearch, present-day, the most sensitive protein sequence alignment method [5]. HHSearch computes a Hidden Markov Model (HMM), similar to simple sequence profiles, but in addition to the amino acid frequencies in the columns of a MSA, they contain the position-specific probabilities for inserts and deletions along the alignment. The HMM is then aligned against the sequence database of  <I>Synechocystis</i> (tax id: 1148, which is a profile-profile alignment. By aligning profile HMMs instead of simple sequence profiles, both sensitivity and alignment quality improve significantly. This allows for the identification of more distant homologous relationships. </p>",
              "<p>(2) <I>Synechococcus elongatus</i> (<I>Synechococcus elongatus</i> hereafter) and <I>Nodularia Spumigena</i> (<I>N. Spumigena</i> hereafter) are phylogenetically closely related to <I>Synechocystis</i> (also cyanobacteria) and widely studied. In <I>Synechococcus elongatus</i>, two C<sub>4</sub>-dicarboxylate transporter(domain)s have been identified: DctM and DctA. In <I>N. Spumigena</i>, a DcuC transporter is putatively identified based on sequence homology studies. In separate searches, each of the gene sequences was used as a template to create a Position Specific Scoring Matrix (PSSM), using PSI-BLAST on the NCBI NR db [6]. This was done in order to 'enrich' the sequence with information from related sequences.. ClustalX is used to create a MSA out of the PSSM, as this is the most sensitive method that is able to take a PSSM as template [7]. The MSA is subsequently taken as a template for HHSearch.</p>",
              "<p>(3) NCBI's Conserved Domain Database is a collection of representative sequences and PSSMs, that represent evolutionarily conserved sequence fragments (or domains) [8]. It provides functional characterization based on the presence of signature sequence patterns and may serve as a starting point for functional annotation and classification. The database has annotated conserved domains for several C<sub>4</sub>-dicarboxylate transport(domain)s: DctP, DctM, Dcu and DcuC. For each of the profiles, Clustal and subsequently HHSearch was used to identify remote homologs in <I>Synechocystis</i>. </p>",
              "<p>(4) The PROSITE database consists of a large collection of biologically meaningful signatures that are described as patterns or profiles [9]. Each signature is linked to a documentation that provides useful biological information on the protein family, domain or functional site identified by the signature. The database has two family signatures (in Clustal output format) for sodium:dicarboxylate symporters. For each of the profiles, HHSearch was used to identify remote homologs in <I>Synechocystis</i>.</p>",
              "<p>All sequence alignment tools are used in default settings unless stated otherwise. The p-value cut-off was set to 1.0 (as to include remote homologs and manually curate the results), except for iterative tools (such as PSI-BLAST) where the cut-off was set to 0.05 to prevent profile wandering.</p>"
            ]
          },
          {
            "id": "id='results1",
            "title": "Results & discussion",
            "contents":
            [
              "<p>As stated in the introduction, sequence identities below 35% are not sufficient to imply a homologous relationship. Therefore, we will only highlight the genes that pop up as a hit in multiple tracks, this to ensure that a random alignment (false positive) will not be taken as putative target.</p>",
              "<p>The first gene that appears 2 times in tracks 2 and once in track 3 is <I>sll1103</i>. It is mapped to the conserved domain of DctM (pfam06808) with an E-value of 2.5 E<sup>-44</sup>, shares 31% sequence identity to the DctM subunit from Synechococcus (EHA61938.1) and 20.7% to DcuC from <I>N. Spumigena</i> (AHJ29173.1) (fig. 3.2). Additionally, sll1104, located in the same transcriptional unit, aligns with an E-value of 1.1 E<sup>-19</sup> in track 1 when using DcuB as a query.</p>",
              "<p> The second gene that appears both in track 2 and 3 is <I>sll1314</i>. This gene is mapped to the conserved domain of DctP (TIGR00787) with an E-value of 3.3E<sup>-106</sup> and shares 25% sequence identity to the DctP subunit from Synechococcus (WP_015168385). </p>",
              "<figure id='fig32'><img src='images/figures/Figure3.2_Alignment.png' class='module-figure-image'><figcaption class='module-figure-text'><b>Figure 3.2</b> <i>Amino acid sequence alignment of the putative C<sub>4</sub>-dicarboxylate transporter in <I>N. Spumigena</i> (DcuC) and <I>Synechocystis</i> (<I>sll1103</i>)</i></figcaption></figure>"
            ]
          }
        ]
      },
      {
        "id": "second",
        "title": "Cultivation experiments to investigate the role of <I>sll1103</i> and <I>sll1314</i> in fumarate transport",
        "sections":
        [
          {
            "id": "intro2",
            "title": "Introduction",
            "contents":
            [
              "<p>Now that we have made an educated guess on the proteins involved in fumarate transport, we need to experimentally validate their function. In order to find the role that these genes may play in fumarate transport, <I>sll1103</i> and <I>sll1314</i> were deleted in <I>Synechocystis</i> wild type and the derivative fumarate producing strain, <i>&#916;fumC</i>. Genes were deleted using a <a href='/Methods.html' class='in-text-link' target='_blank'>markerless genetic modification</a> method. This way, our newly designed strains will never be at risk of passing on to natural environments resistance cassettes. These strains were then characterized phenotypically in a series of different experiments in order to address our different research questions:</p>",
              "<ul class='export-list'><li>We study the effect of the deletions on fumarate efflux by cultivating the double knock-out strains (&#916;fumC&#916;sll1103 and &#916;fumC&#916;sll1314) with &#916;fumC as a control.</li><li>The effect of the deletions on fumarate influx was studied by cultivating the single knock-out strains (&#916;sll1103 and &#916;sll1314) with the wild type as a control in the presence of exogenously supplemented fumarate.</li><li>The postulated promiscuity of the tentatively annotated dicarboxylate transporters, sll1103 and sll1314, was tested for multiple substrates by performing high-throughput phenotyping array screens using BIOLOG plates. </li></ul>"
            ]
          },
          {
            "id": "results2",
            "title": "Results & discussion",
            "contents":
            [
              "<p>The targets <I>sll1103</i> and <I>sll1314</i> (genes encoding putative fumarate transporters) were  deleted on wild type and <i>&#916;fumC</i> background (fig. 3.3). </p>",
              "<figure id='fig33'><img src='images/figures/Figure3.3_knockout_confirmation.png' class='module-figure-image'><figcaption class='module-figure-text'><b>Figure 3.3</b> <i>PCR confirmation of gene deletions on wild type and <I>&#916;fumC</i> background of <I>&#916;sll1103</i> (A) and<I>&#916;sll1314</i> (B). A clean knockout gives a single DNA band at 2.023 bp, while for wild type (WT) this is 3.287 bp. </i></figcaption></figure>",
              "<p>First, we studied the effect of the deletions on fumarate efflux by cultivating the double knock-out strains (<i>&#916;fumC&#916;sll1103</i> and <i>&#916;fumC&#916;sll1314</i>) with <i>&#916;fumC</i> as a control for 150 hours, while monitoring cell growth and fumarate production. We hypothesized that if one of the genes encodes a protein involved in fumarate export, we should measure less extracellular fumarate compared to the control strain.</p>",
              "<p>Neither of the two gene deletions led to an inhibition of cell growth (fig. 3.4A). We are mostly interested in the log phase, as this is where the fumarate is produced (remember that <i>&#916;fumC</i> is a <I>Synechocystis</i> derivative producing fumarate as the cell grows). Zooming in on T = 49 (log phase) we can see that deletion of <I>sll1103</i> causes a diminishable and insignificant decrease in fumarate efflux (fig. 3.4B). Deleting <I>&#916;sll1314</i>, on the contrary, causes a significant decrease in fumarate efflux of 31 % (p-value < 0.01, ANOVA). The fact that we still see extracellular fumarate suggests that <I>sll1314</i> is not the only transport system for fumarate, but this result validates that <I>&#916;sll1314</i> is involved in fumarate transport. </p>",
              "<figure id='fig34'><img src='images/figures/Figure3.4_knockout_experimentdata.png' class='module-figure-image'>  <figcaption clas's=module-figure-te'xt><b>Figure 3.4</b> <i>Cell growth (measured at OD<sub>730</sub>) in different <I>Synechocystis</i> strains under constant light illumination for over 150 hours (A). Fumarate concentration in mM per OD for T = 49. Error bars indicate the 95% confidence interval. (n=3 for double knock-outs, n=2 for <I>&#916;fumC</i>). </i></figcaption></figure>",
              "<p>Secondly, the effect of the deletions on fumarate influx was studied by cultivating the single knock-out strains (<I>&#916;sll1103</i> and <I>&#916;sll1314</i>) with the wild type as a control in the presence of exogenously supplemented fumarate. We hypothesize that if these genes are involved in fumarate import, than we should see a difference in fumarate uptake kinetics under conditions in which cells are forced to uptake fumarate in order to grow, i.e. in the presence of the photosynthesis inhibitor DCMU.</p>",
              "<figure id='fig35'><img src='images/figures/Figure3.5_reassimilation_data.png' class='module-figure-image'>  <figcaption clas's=module-figure-te'xt><b>Figure 3.5</b> <i>Fumarate (mM) over time for different <I>Synechocystis</i> strains cultivated for 6 days. </i></figcaption></figure>",
              "<p>We can see that both wild type and<I>&#916;sll1103</i> have restricted/no capability to assimilate fumarate, under the conditions tested (fig. 3.5). Our results thus strongly hint the absence/deficiency of the fumarate import transporter in <I>Synechocystis</i>.</p>",
              "<p>Lastly, the postulated promiscuity of the tentatively annotated dicarboxylate transporters, <I>sll1103</i> and <I>sll1314</i> ,was tested for multiple substrates by performing high-throughput phenotyping array screens using BIOLOG plates. We hypothesize that if the target genes are involved in the uptake of other compounds, than we should see a difference in this screen when comparing the single knock-out strains (<I>&#916;sll1103</i> and <I>&#916;sll1314</i>) with the wild type as a control. Comparisons can be performed in cells taken from cultures in the light and in the dark, since they display different expressions patterns [13]. </p>",
              "<p>We did not observe any differences in BIOLOG screen between wild type and the derivative knock out strains <I>&#916;sll1103</i> and <I>&#916;sll1314</i>. This suggests that these two genes do not encode proteins involved in the transport of the substrates tested (fig. 3.6) This however does not mean that they may not be involved in the transport of other substrates, or that their expression pattern in wild type under different conditions could not have lead to a different conclusion.</p>",
              "<figure id='fig36'><img src='images/figures/Figure3.6_Biolog_substrates.png' class='module-figure-image'><figcaption class='module-figure-text'><b>Figure 3.6</b> <i>Carbon sources on the BIOLOG Ecoplate.</i></figcaption></figure>"
            ]
          },
          {
            "id": "conc2",
            "title": "Conclusion",
            "contents":
            [
              "<ul class='export-list'><li>We have experimentally validated that sll1314 encodes a transporter protein(domain) involved in fumarate transport as predicted by our bioinformatics analysis.</li><li>We have experimentally validated that Synechocystis wild type and single gene knock-out mutants do not re-assimilate fumarate (even under carbon-limited conditions)</li><li>We have some indication via the 'metabolic fingerprinting' of the single knock-out strains that neither the protein encoded by sll1103 nor sll1314 seems to be involved in the transport of 31 additional substrates.</li><li>A next step would be to overexpress sll1314 in &#916;fumC&#916;zwf (our fumarate cell factory). Overexpression of a fumarate transporter may increase fumarate production even further!</li></ul>"
            ]
          }
        ]
      },
      {
        "id": "third",
        "title": "Investigating the effect of heterologous transporter expression on fumarate transport",
        "sections":
        [
          {
            "id": "intro3",
            "title": "Introduction",
            "contents":
            [
              "<p>Current data on fumarate production in <I>Synechocystis</i> does not indicate that fumarate yields produced in our cell factories exceed the native transport capacity (at least not yet!) [14]. This indicates that overexpressing a transporter is not expected to have a great impact on fumarate productivity. However, this knowledge is based on model predictions and has not been fully experimentally validated.</p>",
              "<p>Therefore, we decided to express in <I>Synechocystis</i> the transporter leading to the highest fumarate yield increase in <I>E. Coli</i> (identified by Zhang et al.)[1]. This is a C<sub>4</sub>-dicarboxylate carrier, DcuC, with efflux as a major function (hereafter termed DcuC-ec). Bearing in mind that transporters are often not expressed or not correctly folded in a non-native host [1], we decided to also include a transporter from an organism that is more closely related phylogenetically. <I>Nodularia Spumigena</i>, also a cyanobacterium, encodes a putative transporter (hereafter termed DcuC-NS), which is similar to the one used in the Zhang study. </p>",
              "<p>Both transporters are from the DcuC family, a family of transporters present only in (facultative) anaerobic bacteria capable of fumarate respiration. DcuC-ec is able to catalyze the uptake, antiport, and efflux of C<sub>4</sub>-dicarboxylates (succinate, fumarate, malate) and C<sub>4</sub>-dicarboxylic amino acids (aspartate), but the Kd values for the various substrates may differ [2]. It is only expressed under anaerobic growth conditions and has efflux as a major function. In the neutral pH range (pH 6-9) divalent C<sub>4</sub>-dicarboxylates (e.g. fumarate<sup>2- </sup>) are the substrates and can leave the cell in counter exchange with succinate (eq. 1) or through electrogenic symport (eq. 2).</p>",
              "<p>fumarate<sub>in</sub><sup>2-</sup> + succinate<sub>out</sub><sup>2-</sup> &#8644;   fumarate<sub>out</sub><sup>2-</sup> + succinate<sub>in</sub><sup>2-</sup>  (1)</p>",
              "<p>3 H<sup>+</sup><sub>in</sub> + fumarate<sub>in</sub><sup>2-</sup> &#8644; 3 H<sup>+</sup><sub>out</sub>  + fumarate<sub>out</sub><sup>2-</sup>   (2)</p>",
              "<p>The transporters were turned into versatile <a href='/Parts.html' class='in-text-link' target='_blank'>BioBricks</a> (<a href='http://parts.igem.org/Part:BBa_K2385001' class='in-text-link' target='_blank'>Bba_K2385001</a> and <a href='/http://parts.igem.org/Part:BBa_K2385000' class='in-text-link' target='_blank'>Bba_K2385000</a>) that have the potential to increase the yields of any organic acid producing cell factory. Standard biological parts (like these) and molecular biology tools have been developed for widely studied organisms as <i>E. Coli</i>. These parts can also be used in other organisms, but characterization of parts in a non-native host, reveals differences in performance. This emphasizes the importance of detailed part-characterization for a specific biological chassis. Good characterization and documentation would open up the possibility of enhancing the productivity of traditional (algal) compounds and producing new ones through metabolic engineering, bringing us one step closer to a biobased economy.</p>",
              "<p>We overexpressed the genes separately in wild type and in the <i>&#916;fumC</i> strain. In order to investigate the effect on fumarate production, we cultivate the newly designed strains and monitor cell growth and fumarate production. </p>"
            ]
          },
          {
            "id": "results3",
            "title": "Results & discussion",
            "contents":
            [
              "<p>We overexpressed DcuC-ec and DcuC-NS (ec = <I>E. Coli</i>, NS = <I>N. Spumigena</i>, cyanobacterium) separately in wild type and in the <i>&#916;fumC</i> strain. Unfortunately, we were only able to get the strains on wild type background ready in time (fig. 3.7). Nonetheless, we can still study the effect on fumarate efflux by cultivating the expression strains (DcuC-ec and DcuC-NS) on the wild type background, while using <i>&#916;fumC</i> as a positive control, while monitoring cell growth and fumarate production for 150 hours.</p>",
              "<figure id='fig37'><img src='images/figures/Figure3.7_DcuC_confirmation1.png' class='module-figure-image'><figcaption class='module-figure-text'><b>Figure 3.7</b> <i>PCR confirmation of gene expressions on wild type background of DcuC-ec and DcuC-NS. A clean expression gives a single DNA band around 3.120 bp, while for wild type (NC) this is approximately 312 bp. </i></figcaption></figure>",
              "<p>After 150 hours, no extracellular fumarate is being produced by neither the DcuC-ec nor DcuC-NS expression strains (fig. 3.8A). The &#916;fumC is used as a control for fumarate production and produces roughly 1 mM of fumarate after 150 hours. This indicates that under these conditions heterologous expression of DcuC alone, irrespective if it is from <I>E. Coli</i> or <I>N. Spumigena</i>, is not sufficient for fumarate to be secreted above our detection limit (~0.05 mM). To our surprise, we measure extracellular lactate being produced by DcuC-NS with a maximum of 5 mM (fig. 8B). Lactate often indicates that there is a contaminant, but extensive contamination checks did not show contamination of any kind.</p>",
              "<figure id='fig38'><img src='images/figures/Figure3.8_overexpression_data.png' class='module-figure-image'><figcaption class='module-figure-text'><b>Figure 3.8</b> <i>Extracellular fumarate (A) and lactate (B) production in different <I>Synechocystis</i> strains under constant light illumination for over 150 hours. (n=3 for expression strains, n=2 for &#916;fumC). The blue dots (in A) and the red dots (in B) are at the zero baseline underneath the other strain.</i></figcaption></figure>"
            ]
          },
          {
            "id": "conc3",
            "title": "Conclusion",
            "contents":
            [
              "<ul class='export-list'><li>We were able to integrate the heterologous transporters DcuC-ec and DcuC-NS into the genome of Synechocystis. When cultivating for 150 hours, no extracellular fumarate was produced by the DcuC-ec or DcuC-NS expression strain.</li><li>DcuC-NS is a putative C4-dicarboxylate transporter, but yet no experimental evidence can support this. Therefore, more extensive experiment have to be done on this transporter to confirm its function.</li><li>The transporters were turned into versatile <a href='/Parts.html' class='in-text-link' target='_blank'>BioBricks</a> (<a href='http://parts.igem.org/Part:BBa_K2385001' class='in-text-link' target='_blank'>Bba_K2385001</a> and <a href='/http://parts.igem.org/Part:BBa_K2385000' class='in-text-link' target='_blank'>Bba_K2385000</a>) that have the potential to increase the yields of any organic acid producing cell factory.</li><li>A next step would be to express DcuC-ec and DcuC-NS on the &#916;fumC background that is already producing fumarate to see if this could further boost fumarate production. This will test simultaneously whether intracellular fumarate was the limiting factor in the experiment described above; and whether it is inhibiting its own production, and potentially even growth, in the strain with the &#916;fumC genotype.</li></ul>",
              "",
              ""
            ]
          }
        ]
      },
      {
        "id": "fourth",
        "title": "How we made the magic happen",
        "sections":
        [
          {
            "id": "",
            "title": "Materials & Methods",
            "contents":
            [
              "<p class='project-header'>Cultivation conditions</p>",
              "<p>Cultures during plasmid construction in <I>E. Coli</i> were grown on Luria-Bertani (LB) plates (1,5% agar) or LB liquid medium at 37&#8451; in an incubator with a shaking speed of 200 rpm. <I>Synechocystis</i> was grown in BG11 standard medium, together with 10 mM TES-NaOH (pH = 8.0). Appropriate antibiotics were used, alone or in combination, in the following concentrations: 50 &#956;g mL<sup>-1</sup> kanamycin, 100 &#956;g mL<sup>-1</sup> ampicillin and 30 &#956;g mL<sup>-1</sup> nickel. </p>",
              "<p class='project-header'>Sampling and Fumarate measurements</p>",
              "<p>Cell culture samples were harvested at selected time points for OD and fumarate analysis. 1 ml of sample was centrifuged at 15.000 rpm  for 10 min. Then 500 &#956;l supernatant was taken and filtered (Sartorius Stedin Biotech, minisart SRP 4, 0.22 &#956;m) for sample preperation. Fumarate concentration was measured by HPLC-UV/VIS (LC-20AT, Prominence, Shimadzu), with ion exclusion Rezex ROA-Organic Acid column (250x4.6 mm; Phenomenex) and UV detector (SPD-20A, Prominence, Shimadzu) at 210 nm wavelength. 10 &#956;L of the HPLC samples were injected through an autosampler (SIL-20AC, Prominence, Shimadzu), with 5 mM H<sub>2</sub>SO<sub>4</sub> as eluent at a flow rate of 0.15 ml min<sup>-1</sup> and column temperature of 45 &#8451;. </p>",
              "<p class='project-header'>Deleting putative transporter encoding genes in <I>Synechocystis</i></p>",
              "<p><I>sll1103</i> (BAA18318.1) and <I>sll1314</i> (BAL35144.1) were deleted in wild type <I>Synechocystis</i> and in the fumarate producing <i>&#916;fumC</i> strain. Gene deletion was done according to the <a href='/Methods.html' class='in-text-link' target='_blank'>markerless genetic modification</a> method, with kanamycin as a positive selection marker (50 &#956;g/ml). Homologous regions were amplified using primers up_fwd and up_rev (H1) and down_fwd and down_rev (H2). Segregation was checked using (colony)PCR with primers up_fwd and down_rev. All primers used are listed in table 1. The resulting, markerless deletion strains are listed in table 2.</p>",
              "<figure id='table31'><img src='images/figures/Table1_primer_list.png' class='module-figure-image'><figcaption class='module-figure-text'><b>Table 1.</b> <i>Primers used in this study.</i></figcaption></figure>",
              "<figure id='table32'><img src='images/figures/Table2_strain_list.png' class='module-figure-image'><figcaption class='module-figure-text'><b>Table 2.</b> <i>Strains constructed in this study.</i></figcaption></figure>",
              "<p class='project-header'>Overexpressing transporters to increase fumarate yield</p>",
              "<p>For the expression of heterologous transporters in <I>Synechocystis</i>, a C<sub>4</sub>-dicarboxylate transporter gene DcuC (NP_415154) was amplified from the genome DNA of <I>Escherichia coli</i>. Homologous regions were amplified using primers DcuC_ec_up_fwd and DcuC_ec_up_rev (H1) and DcuC_ec_down_fwd and DcuC_ec_down_rev (H2). DcuC-NS (AHJ29173.1) from <I>Nodularia Spumigena</i> was synthesized at IDT as a gene-block. The genes were integrated into the genome of wild type <I>Synechocystis</i> and <i>&#916;fumC</i>, directly downstream of the psbA2 promotor, as described elsewhere [15]. Segregation was checked using (colony)PCR with primers on the expression vector. All primers used are listed on in table 1. The resulting expression strains are listed in table 2.</p>"
            ]
          },
          {
            "id": "",
            "title": "Characterisation",
            "contents":
            [
              "<p>We study the effect of gene modifications on growth and fumarate transport in a <a href='/Methods.html#multicultivator' class='in-text-link' target='_blank'>multi-cultivator</a>. The cultivator consists of eight vessels, each containing a <I>Synechocystis</i> strain. </p>",
              "<p class='project-header'>Experiment 1 - The effect of gene deletions on fumarate efflux<p>",
              "<p>We study the effect of the gene deletions on fumarate efflux by cultivating the double knock-out strains <i>&#916;fumC</i><I>&#916;sll1103</i> (in triplicate) and <i>&#916;fumC</i><I>&#916;sll1314</i> (in triplicate), with <i>&#916;fumC</i> (produces fumarate in a stable fashion) as a control (in duplicate). Sampling was done once a day, as described above. </p>",
              "<p class='project-header'>Experiment 2 - The effect of gene deletions on fumarate influx</p>",
              "<p>We study the effect of the gene deletions on fumarate influx by cultivating the single knock-out strain <I>&#916;sll1103</i> (in duplo) and wild type <I>Synechocystis</i> (in duplo) with and without external fumarate supplemented (5mM) to the cultures. Sampling was done once a day, as described above. </p>",
              "<p class='project-header'>Experiment 3 - The effect of gene deletions on the 'metabolic fingerprint' of <I>Synechocystis</i></p>",
              "<p>Further characterization of the deletion strains was done making a so called 'metabolic fingerprint' on a Biolog Ecoplate<sup>TM</sup>. This was done for the single knock-out strains <I>&#916;sll1103</i> and <I>&#916;sll1314</i>, with wild type as a control. The Biolog Ecoplate<sup>TM</sup> comprises of 96 wells, containing 31 of the most useful carbon sources in triplicate [16]. Formation of purple color occurs when the microbes can utilize the carbon source and begin to respire. The respiration of the cells in the community reduces a tetrazolium dye that is included with the carbon source. One plate was inoculated in singleton with wild type, <I>&#916;sll1103</i> and <I>&#916;sll1314</i> at OD<sub>730</sub> 0.5 from a culture that had been growing in continuous light. The plate was incubated at 30 &#8451; and OD was measured daily with a BMG FluoStar Optima plate reader, using emission at 600 nm. Another plate was inoculated according to the same scheme, after 24 hours of dark incubation. </p>",
              "<p class='project-header'>Experiment 4 - The effect of heterologous gene expression on fumarate efflux</p>",
              "<p>We study the effect of the heterologous gene expressions on fumarate efflux by cultivating the DcuC-ec (in triplicate) and DcuC-NS (in triplicate), with <i>&#916;fumC</i> (produces fumarate in a stable fashion) as a control (in duplicate). Sampling was done once a day, as described above. </p>"
            ]
          }
        ]
      }
    ],
    "supplementary":
    [
      ""
    ]
  }
}
